Revit 2024 API
Reference.LinkedElementId Property
The id of the top-level element in the linked document that is referred to by this reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId LinkedElementId { get; }
Visual Basic
Public ReadOnly Property LinkedElementId As ElementId
	Get
Visual C++
public:
property ElementId^ LinkedElementId {
	ElementId^ get ();
}
Remarks
InvalidElementId will be returned for references that don't refer to an element in a linked RVT file.
See Also
Reference Class
Autodesk.Revit.DB Namespace